#### DialogBoxShowingEventArgs Members

---

|  |
| --- |
| DialogBoxShowingEventArgs Class   Methods   Properties   See Also |

The  DialogBoxShowingEventArgs  type exposes the following members.

# Methods

|  | Name | Description |
| --- | --- | --- |
| Public method | Cancel | When the event is cancellable, may call the Cancel() method to cancel it. (Inherited from  RevitAPIPreEventArgs  .) |
| Public method | Dispose | (Inherited from  RevitAPIEventArgs  .) |
| Public method | Equals | Determines whether the specified  Object  is equal to the current  Object  . (Inherited from  Object  .) |
| Public method | GetHashCode | Serves as a hash function for a particular type. (Inherited from  Object  .) |
| Public method | GetType | Gets the  Type  of the current instance. (Inherited from  Object  .) |
| Public method | IsCancelled | Indicates whether the event is being cancelled. (Inherited from  RevitAPIEventArgs  .) |
| Public method | OverrideResult | Call this method to cause the Autodesk Revit dialog to be dismissed with the specified return value. |
| Public method | ToString | Returns a string that represents the current object. (Inherited from  Object  .) |

# Properties

|  | Name | Description |
| --- | --- | --- |
| Public property | Cancellable | Indicates whether an event may be cancelled by an event delegate. (Inherited from  RevitAPIEventArgs  .) |
| Public property | DialogId | A unique string identifier for DialogBox and TaskDialog type dialogs in Revit. |
| Public property | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. (Inherited from  RevitAPIEventArgs  .) |

# See Also

DialogBoxShowingEventArgs Class

Autodesk.Revit.UI.Events Namespace